app/controllers/project_details_controller.rb

  def index
    @project_details = ProjectDetail.paginate(page: params[:page],
                             per_page: params[:per_page])
                   .order('project_year,project_id,project_name')
---
SELECT "project_details".* FROM "project_details" ORDER BY project_year,project_id,project_name LIMIT 8 OFFSET 0

 def search
    @project_details = ProjectDetail.like(params[:query]).paginate(page: params[:page],
                             per_page: params[:per_page])
                   .order('project_year,project_id,project_name')
---
SELECT "project_details".* FROM "project_details" WHERE (project_id LIKE '%oae-58-01%' OR project_name LIKE '%oae-58-01%' OR project_year LIKE '%oae-58-01%' OR vender_id LIKE '%oae-58-01%' OR contract_id LIKE '%oae-58-01%') ORDER BY project_year,project_id,project_name LIMIT 8 OFFSET 0